Attribute VB_Name = "Module1"
'%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
'        ＥｘｃｅｌＶＢＡ  基  本
'%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

'*******************************************************************************
'        全 ブッククローズ
'*******************************************************************************
Sub AllBookClose()

    Workbooks.Close
    
End Sub

'*******************************************************************************
'        アクティブブッククローズ
'*******************************************************************************
Sub ActiveBookClose()

    ActiveWorkbook.Close
    
End Sub

'*******************************************************************************
'        指定ブッククローズ1
'*******************************************************************************
Sub SiteiBookClose()

    Workbooks("Dummy.xls").Close
'   Workbooks(5).Close
    
End Sub

'*******************************************************************************
'        ブックセーブクローズ (確認なし)
'*******************************************************************************
Sub BookSave_NoConf()

    Workbooks("Dummy.xls").Close SaveChanges:=True
        
End Sub

'*******************************************************************************
'        ブックキャンセルクローズ (確認なし)
'*******************************************************************************
Sub BookCancel_NoConf()

    Workbooks("Dummy.xls").Close SaveChanges:=False
    
End Sub

'*******************************************************************************
'        ブック アクティブ
'*******************************************************************************
Sub BookActivate()

    Workbooks("Dummy.xls").Activate
    
End Sub

'*******************************************************************************
'        ブック 保存
'*******************************************************************************
Sub BookSave()

    ActiveWorkbook.Save
'   Workbooks("Dummy.xls").Save
    
End Sub

'*******************************************************************************
'        新規シート 挿入
'*******************************************************************************
Sub NewSheetInsert()

    Worksheets.Add
'   Worksheets.Add after:=Worksheets(1), Count:=2
    
End Sub

'*******************************************************************************
'        ブック 名前付け保存
'*******************************************************************************
Sub BookSave_NewNamed()

    ActiveWorkbook.SaveAs _
        Filename:="C:\Documents and Settings\笠原　浩\My Documents\Dummy2.xls"

End Sub

'*******************************************************************************
'        ループ処理
'*******************************************************************************
'        処理概要：セルの行列の対角線上に数字を1から順に199までセットし101から
'                  折り返す
'*******************************************************************************
Sub Input1to100()

    Dim i As Integer
    Dim j As Integer
        
    Worksheets("Sheet1").Activate
    Cells.Select
    Selection.ColumnWidth = 3.5
    Range("a1").Select
        
    For i = 1 To 100
        Cells(i, i) = i
    Next i
    For i = 101 To 199
        j = i - 100
        Cells(i, 100).Offset(, -j) = i
   Next i
   
End Sub

'*******************************************************************************
'        セルの数式と値  クリア
'*******************************************************************************
Sub CellClearContents()

    Cells.Select
    Selection.ClearContents
    Range("a1").Select
        
End Sub

'*******************************************************************************
'        行の非表示
'*******************************************************************************
Sub RowHidden()

    Workbooks("Book1").Activate
    Worksheets("Sheet2").Rows("5:7").Hidden = True
    
End Sub

'*******************************************************************************
'        選択セル範囲の行数取得
'*******************************************************************************
Sub RowsCountGet()

'   選択セル範囲の行数取得
    ActiveWorkbook.Worksheets("Sheet1").Activate
    Range("b10:f18").Select
    
    MsgBox Selection.Rows.Count
   'EntireRow に文字列セット
    Selection.EntireRow.Value = "VBA"
    
   'シートの全行数を取得
    MsgBox ActiveSheet.Rows.Count
    
End Sub

'*******************************************************************************
'        オートフィルタされたデータの表示行のみをSelect
'*******************************************************************************
Sub CurrentRegionVisibleSelect()

    Range("A1").CurrentRegion.SpecialCells(xlCellTypeVisible).Select

End Sub

'*******************************************************************************
'        可視セルのみをCopy
'*******************************************************************************
Sub CurrentRegionVisibleCopy()

'   （オートフィルタによる可視セルのみのCopyは通常のコピーで可能）
    Range("A1").CurrentRegion.Select
    Selection.SpecialCells(xlCellTypeVisible).Copy
    
'   別のシートに貼り付ける
    Worksheets("Sheet2").Select
    ActiveSheet.Paste

End Sub

'*******************************************************************************
'        カレントリージョンにおいて最後のセルのアドレスを取得する
'*******************************************************************************
Sub LastCellAddressGet1()

    MsgBox ActiveSheet.Cells.SpecialCells(xlCellTypeLastCell).Address()

End Sub

'*******************************************************************************
'        返されたセル範囲のコロン(:)より後の文字列を取得する
'*******************************************************************************
Sub LastCellAddressGet2()

    Dim myLastCell As String
    
    myLastCell = ActiveSheet.UsedRange.Address()

    myLastCell = Mid(myLastCell, InStr(myLastCell, ":") + 1)
    MsgBox myLastCell
End Sub
