Option Explicit
'*******************************************************************************
'        シート全体フォント正規化処理
'*******************************************************************************
'      < 処理概要 >
'        シート全体の文字フォントを「ＭＳ 明朝」に変更する
'*******************************************************************************
Public Sub シート全体_MS明朝_正規化()

  Dim nSize  As Long
  
  nSize = Application.InputBox(Prompt:="フォントサイズを入力する", _
                               Title:="ＭＳ 明朝 フォントサイズ指定", _
                               Default:=10, _
                               Type:=1)
  If nSize = 0 Then
    Exit Sub
  End If
  
  With Cells.Font
    .Name = "ＭＳ 明朝"
    .Size = nSize
    .Bold = False
  End With

End Sub
